### groupby()

The groupby is one of the most frequently used Pandas functions in data analysis. It is used for grouping the data points (i.e. rows) based on the distinct values in the given column or columns. We can then calculate aggregated values for the generated groups.

In [20]:
import pandas as pd
import numpy as np

df1 = pd.read_csv(r'C:\Users\Acer\FIREBLAZE\Employee.csv')

df1

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [5]:
#example

# g=df1.groupby('gender')

# g.get_group('M')

# g1.get_group('F')['salary']

# g.get_group('M')['salary'].mean()



# g2 = df1.groupby(['gender','city'])

# g2.get_group(('M','pune'))['salary']

In [ ]:
# examples

In [21]:
df1

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [24]:
v1 = df1.groupby('gender')
v1

In [25]:
v1.groups

{'F': [1, 4, 6, 7, 8, 9, 11, 12], 'M': [0, 2, 3, 5, 10, 13, 14]}

In [26]:
v1.get_group('M')

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
5   1006      M  bhandara           5  50000.0
10  1011      M    nagpur           9  90000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [27]:
v1.get_group('F')

      Id gender      city  experience   salary
1   1002      F    mumbai           5  50000.0
4   1005      F      beed           7  70000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0

In [34]:
v1.get_group('F')['salary'].sum()

360000.0

In [35]:
v1.get_group('F')['salary'].mean()

45000.0

In [37]:
v1 = df1.groupby(['gender','city'])
v1

In [38]:
v1.groups

{('F', 'beed'): [4, 6], ('F', 'bhandara'): [12], ('F', 'gondia'): [11], ('F', 'mumbai'): [1], ('F', 'nagpur'): [8], ('F', 'pune'): [7, 9], ('M', 'beed'): [3], ('M', 'bhandara'): [5], ('M', 'gondia'): [13], ('M', 'nagpur'): [10, 14], ('M', 'pune'): [0, 2]}

In [39]:
df1

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [40]:
v1.get_group(('M','pune'))

     Id gender  city  experience   salary
0  1001      M  pune           1  10000.0
2  1003      M  pune           4      NaN

In [2]:
v1.get_group(('F','pune'))

NameError: name 'v1' is not defined

In [43]:
v1.get_group(('F','bhandara'))['salary']

12    10000.0
Name: salary, dtype: float64

### Crosstab

- The Crosstab function is one of the many methods that help you reshape your data in Pandas.
- frequency count

In [ ]:
# example1

In [2]:
import pandas as pd

df2 = pd.read_excel(r'C:\Users\Acer\Downloads\survey.xls')

df2

      Name Nationality  Gender  Age Handedness
0    Kathy         USA  Female   23      Right
1    Linda         USA  Female   18      Right
2    Peter         USA    Male   19      Right
3     John         USA    Male   22       Left
4   Fatima   Bangadesh  Female   31       Left
5    Kadir   Bangadesh    Male   25       Left
6   Dhaval       India    Male   35       Left
7   Sudhir       India    Male   31       Left
8   Parvir       India  Female   37      Right
9      Yan       China  Female   52      Right
10    Juan       China  Female   58       Left
11   Liang       China    Male   43       Left

In [45]:
pip install xlrd

Collecting xlrd
  Downloading xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
     ---------------------------------------- 96.5/96.5 kB 1.8 MB/s eta 0:00:00
Installing collected packages: xlrd
Successfully installed xlrd-2.0.1
Note: you may need to restart the kernel to use updated packages.

In [3]:
df2

      Name Nationality  Gender  Age Handedness
0    Kathy         USA  Female   23      Right
1    Linda         USA  Female   18      Right
2    Peter         USA    Male   19      Right
3     John         USA    Male   22       Left
4   Fatima   Bangadesh  Female   31       Left
5    Kadir   Bangadesh    Male   25       Left
6   Dhaval       India    Male   35       Left
7   Sudhir       India    Male   31       Left
8   Parvir       India  Female   37      Right
9      Yan       China  Female   52      Right
10    Juan       China  Female   58       Left
11   Liang       China    Male   43       Left

In [4]:
pd.crosstab(df2.Nationality,df2.Handedness)

Handedness   Left  Right
Nationality
Bangadesh       2      0
China           2      1
India           2      1
USA             1      3

In [5]:
#example2

pd.crosstab(df2.Gender,df2.Handedness)

Handedness  Left  Right
Gender
Female         2      4
Male           5      1

In [8]:
#example3

pd.crosstab([df2.Nationality,df2.Gender],[df2.Handedness])

Handedness          Left  Right
Nationality Gender
Bangadesh   Female     1      0
            Male       1      0
China       Female     1      1
            Male       1      0
India       Female     0      1
            Male       2      0
USA         Female     0      2
            Male       1      1

#### margins

In [9]:
# example


pd.crosstab([df2.Nationality,df2.Gender],[df2.Handedness],margins=True)

Handedness          Left  Right  All
Nationality Gender
Bangadesh   Female     1      0    1
            Male       1      0    1
China       Female     1      1    2
            Male       1      0    1
India       Female     0      1    1
            Male       2      0    2
USA         Female     0      2    2
            Male       1      1    2
All                    7      5   12

In [10]:
pd.crosstab(df2.Gender,df2.Handedness,margins=True,margins_name='Sum')

Handedness  Left  Right  Sum
Gender
Female         2      4    6
Male           5      1    6
Sum            7      5   12

### multi index,columns

In [11]:
pd.crosstab([df2.Nationality,df2.Gender],[df2.Handedness],margins=True,margins_name='Sum')

Handedness          Left  Right  Sum
Nationality Gender
Bangadesh   Female     1      0    1
            Male       1      0    1
China       Female     1      1    2
            Male       1      0    1
India       Female     0      1    1
            Male       2      0    2
USA         Female     0      2    2
            Male       1      1    2
Sum                    7      5   12

### multi index,columns

In [16]:

# pd.crosstab([df2.Nationality,df2.Gender],[df2.Handedness],margins=True)

## pivot

- Reshape data
- duplication not allowed
- To summarized the data

In [2]:
import pandas as pd

df3 = pd.read_csv('Employee.csv')

df3

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [ ]:
# Syntax

dataframe_name.pivot(index='column_name',columns='columns_name')

In [59]:
df3.pivot(index='Id',columns='gender',values='salary')

df3


df3.pivot(index='Id',columns='city',values='salary')

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [5]:
# example2

df3.pivot(index='Id',columns='city',values='salary')

city     beed  bhandara   gondia   mumbai   nagpur     pune
Id
1001      NaN       NaN      NaN      NaN      NaN  10000.0
1002      NaN       NaN      NaN  50000.0      NaN      NaN
1003      NaN       NaN      NaN      NaN      NaN      NaN
1004  60000.0       NaN      NaN      NaN      NaN      NaN
1005  70000.0       NaN      NaN      NaN      NaN      NaN
1006      NaN   50000.0      NaN      NaN      NaN      NaN
1007  20000.0       NaN      NaN      NaN      NaN      NaN
1008      NaN       NaN      NaN      NaN      NaN  80000.0
1009      NaN       NaN      NaN      NaN  60000.0      NaN
1010      NaN       NaN      NaN      NaN      NaN  30000.0
1011      NaN       NaN      NaN      NaN  90000.0      NaN
1012      NaN       NaN  40000.0      NaN      NaN      NaN
1013      NaN   10000.0      NaN      NaN      NaN      NaN
1014      NaN       NaN  80000.0      NaN      NaN      NaN
1015      NaN       NaN      NaN      NaN  50000.0      NaN

In [6]:
# # example3


df3.pivot(index='gender',columns='Id',values='salary')

Id,1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,1011,1012,1013,1014,1015
gender,,,,,,,,,,,,,,,
F,NaN,50000.0,NaN,NaN,70000.0,NaN,20000.0,80000.0,60000.0,30000.0,NaN,40000.0,10000.0,NaN,NaN
M,10000.0,NaN,NaN,60000.0,NaN,50000.0,NaN,NaN,NaN,NaN,90000.0,NaN,NaN,80000.0,50000.0

In [7]:
df3.pivot(index='gender',columns='city',values='salary')

ValueError: Index contains duplicate entries, cannot reshape

## pivot_table

-duplication allowed
-use for reshaping data

In [9]:
df3

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [16]:
df3.pivot_table(index='gender',columns='city',values='salary',fill_value=0)

city     beed  bhandara  gondia  mumbai  nagpur   pune
gender
F       45000     10000   40000   50000   60000  55000
M       60000     50000   80000       0   70000  10000

In [ ]:
# df3.pivot_table(index='gender',columns='city',values='salary',aggfunc='sum')

In [17]:
df3.pivot_table(index='gender',columns='city',values='salary',aggfunc='max')

city       beed  bhandara   gondia   mumbai   nagpur     pune
gender
F       70000.0   10000.0  40000.0  50000.0  60000.0  80000.0
M       60000.0   50000.0  80000.0      NaN  90000.0  10000.0

## datetime module

In [18]:
import datetime

In [19]:
# datetime.datetime.now()

In [ ]:
# datetime.datetime.today()

In [19]:
datetime.datetime.now()

datetime.datetime(2023, 7, 24, 14, 59, 32, 311029)

In [20]:
datetime.datetime.today()

datetime.datetime(2023, 7, 24, 15, 0, 48, 567913)

In [21]:
current_date = datetime.datetime.now()

In [22]:
current_date

datetime.datetime(2023, 7, 24, 15, 2, 18, 502989)

In [24]:
current_date.year

2023

In [25]:
current_date.month

7

In [26]:
current_date.day

24

In [28]:
current_date.hour

15

In [30]:
current_date.minute

2

In [31]:
current_date.second

18

In [32]:
current_date.microsecond

502989

In [33]:
print(current_date.day,'/',current_date.month,'/',current_date.year)

24 / 7 / 2023

In [40]:
print(current_date.day,'-',current_date.month,'-',current_date.year  )

24 - 7 - 2023

## strftime

string formatting time

%a Weekday, short version
%A Weekday, full version
%w Weekday as a number 0-6, 0 is Sunday
%d Day of month 01-31
%b Month name, short version
%B Month name, full version
%m Month as a number
%y Year, short version, without century
%Y Year, full version

In [ ]:
# current_date.strftime('%A')

# print(current_date.strftime('%d %B %Y'))

In [41]:
#examples


current_date

datetime.datetime(2023, 7, 24, 15, 2, 18, 502989)

In [42]:
current_date.strftime('%a')

'Mon'

In [ ]:
current_date.strftime('%A')

In [45]:
current_date.strftime('%w')

'1'

In [46]:
current_date.strftime('%d')

'24'

In [47]:
current_date.strftime('%D')

'07/24/23'

### Months name

In [48]:
current_date.strftime('%b')

'Jul'

In [49]:
current_date.strftime('%B')

'July'

#### Month as a number

In [50]:
current_date.strftime('%m')

'07'

### year

In [51]:
current_date.strftime('%y')

'23'

In [52]:
current_date.strftime('%Y')

'2023'

## isoweekday

mon=1
tue=2
sunday=7

In [54]:
current_date.isoweekday()

1

## weekday()

In [55]:
mon=0
sun=6

In [56]:
#example


current_date.weekday()

0

## date_range()

In [57]:
import pandas as pd


f=pd.date_range('2023',periods=10)

f

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10'],
              dtype='datetime64[ns]', freq='D')

## Aggregate Function

sum
mean
std
var
min
max

In [62]:
df3

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [63]:
z2=df3.agg(['max','min','sum','std','var'])
z2

C:\Users\Acer\AppData\Local\Temp\ipykernel_17892\116822281.py:1: FutureWarning: ['gender', 'city'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  z2=df3.agg(['max','min','sum','std','var'])

,Id,gender,city,experience,salary
max,1015.000000,M,pune,9.000000,9.000000e+04
min,1001.000000,F,beed,1.000000,1.000000e+04
sum,15120.000000,MFMMFMFFFFMFFMM,punemumbaipunebeedbeedbhandarabeedpunenagpurpu...,74.000000,7.000000e+05
std,4.472136,NaN,NaN,2.491892,2.572039e+04
var,20.000000,NaN,NaN,6.209524,6.615385e+08

In [64]:
df2 = pd.read_csv(r'C:\Users\Acer\Downloads\data.csv')
df2

   sub1  sub2  sub3  sub4  sub5  sub6
0    50    54    45    65    60    78
1    63    74    54    54    47    50
2    41    58    65    54    45    46
3    78    69    56    65    63    64
4    96    45    60    78    52    52
5    96    45    60    78    52    52
6    35    55    66    77    52    50
7    65    66    45    58    63    63
8    35    55    66    77    52    50

In [65]:
z2=df2.agg(['max','min','sum','std','var'])
z2

           sub1        sub2        sub3        sub4        sub5        sub6
max   96.000000   74.000000   66.000000   78.000000   63.000000   78.000000
min   35.000000   45.000000   45.000000   54.000000   45.000000   46.000000
sum  559.000000  521.000000  517.000000  606.000000  486.000000  505.000000
std   24.033541   10.080234    8.217529   10.416333    6.557439   10.227957
var  577.611111  101.611111   67.527778  108.500000   43.000000  104.611111

In [66]:
z1=df2.agg('mean')

z1

sub1    62.111111
sub2    57.888889
sub3    57.444444
sub4    67.333333
sub5    54.000000
sub6    56.111111
dtype: float64

In [67]:
z1=df2.agg('min')

z1

sub1    35
sub2    45
sub3    45
sub4    54
sub5    45
sub6    46
dtype: int64

In [68]:
z1=df2.agg('std')

z1

sub1    24.033541
sub2    10.080234
sub3     8.217529
sub4    10.416333
sub5     6.557439
sub6    10.227957
dtype: float64